# VSCode Extensions

# Theme and Icons
zhuangtongfa.material-theme
pkief.material-icon-theme

# Programming Languages
ms-python.python
ms-vscode.powershell
ms-vscode.cpptools
rust-lang.rust-analyzer
golang.go
redhat.java
dbaeumer.vscode-eslint
esbenp.prettier-vscode

# Git Integration
eamodio.gitlens
donjayamanne.githistory

# Docker and Kubernetes
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools

# Database Tools
mtxr.sqltools
mtxr.sqltools-driver-mysql
mtxr.sqltools-driver-pg
mongodb.mongodb-vscode

# Remote Development
ms-vscode-remote.remote-wsl
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh

# Utilities
yzhang.markdown-all-in-one
shd101wyy.markdown-preview-enhanced
streetsidesoftware.code-spell-checker
gruntfuggly.todo-tree
christian-kohler.path-intellisense
formulahendry.code-runner